In [4]:
#set up the working environment by calling toolkits
import pandas as pd
import numpy as np
import statistics
import matplotlib.pyplot as plt
%matplotlib inline

In [44]:
data = pd.DataFrame()
data['name'] = ['Greg', 'Marcia', 'Peter', 'Jan', 'Bobby', 'Cindy', 'Oliver']
data['age'] = [14, 12, 11, 10, 8, 6, 8]

print(data)
data.describe()

     name  age
0    Greg   14
1  Marcia   12
2   Peter   11
3     Jan   10
4   Bobby    8
5   Cindy    6
6  Oliver    8

             age
count   7.000000
mean    9.857143
std     2.734262
min     6.000000
25%     8.000000
50%    10.000000
75%    11.500000
max    14.000000

In [45]:
print(data['age'].mode())
print(data['age'].median())
print(data['age'].var())
print((data['age'].std()/(data['age'].count()**.5)))

0    8
dtype: int64
10.0
7.476190476190475
1.0334540197243192

In [46]:
data.loc[data['name'] == 'Cindy', 'age'] = 7

print(data)
data.describe()

     name  age
0    Greg   14
1  Marcia   12
2   Peter   11
3     Jan   10
4   Bobby    8
5   Cindy    7
6  Oliver    8

             age
count   7.000000
mean   10.000000
std     2.516611
min     7.000000
25%     8.000000
50%    10.000000
75%    11.500000
max    14.000000

In [47]:
print(data['age'].mode())
print(data['age'].median())
print(data['age'].var())
print((data['age'].std()/(data['age'].count()**.5)))

0    8
dtype: int64
10.0
6.333333333333333
0.9511897312113418

In [60]:
data.loc[data['name'] == 'Oliver', 'age'] = 1
data.loc[data['age'] == 1,  'name'] = 'Jessica'

print(data)

      name  age
0     Greg   14
1   Marcia   12
2    Peter   11
3      Jan   10
4    Bobby    8
5    Cindy    7
6  Jessica    1

In [61]:
print(data['age'].mode())
print(data['age'].median())
print(data['age'].var())
print((data['age'].std()/(data['age'].count()**.5)))
data.describe()

0     1
1     7
2     8
3    10
4    11
5    12
6    14
dtype: int64
10.0
18.0
1.6035674514745462

             age
count   7.000000
mean    9.000000
std     4.242641
min     1.000000
25%     7.500000
50%    10.000000
75%    11.500000
max    14.000000